In [32]:
import pandas as pd

orders = pd.read_csv("orders.csv")
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [33]:
users = pd.read_json("users.json")
users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [34]:
import sqlite3, pandas as pd

conn = sqlite3.connect("restaurants_final.db")
cursor = conn.cursor()

with open("restaurants.sql", "r", encoding="utf-8") as f:
    sql_script = f.read()

# Make CREATE TABLE safe to run multiple times
sql_script = sql_script.replace(
    "CREATE TABLE restaurants",
    "CREATE TABLE IF NOT EXISTS restaurants"
)

cursor.executescript(sql_script)
conn.commit()

restaurants = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [35]:
final_df = orders.merge(users, on="user_id", how="left")
final_df = final_df.merge(restaurants, on="restaurant_id", how="left")

final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
2,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
3,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
4,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5

In [36]:
final_df.shape

(40000, 12)

In [37]:
final_df.info()
final_df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40000 entries, 0 to 39999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           40000 non-null  int64
 1   user_id            40000 non-null  int64
 2   restaurant_id      40000 non-null  int64
 3   order_date         40000 non-null  object
 4   total_amount       40000 non-null  float64
 5   restaurant_name_x  40000 non-null  object
 6   name               40000 non-null  object
 7   city               40000 non-null  object
 8   membership         40000 non-null  object
 9   restaurant_name_y  40000 non-null  object
 10  cuisine            40000 non-null  object
 11  rating             40000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 3.7+ MB

order_id             0
user_id              0
restaurant_id        0
order_date           0
total_amount         0
restaurant_name_x    0
name                 0
city                 0
membership           0
restaurant_name_y    0
cuisine              0
rating               0
dtype: int64

In [38]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

In [39]:
final_df[final_df["membership"]=="Gold"] \
.groupby("city")["total_amount"].sum().idxmax()

'Chennai'

In [40]:
final_df.groupby("cuisine")["total_amount"].mean().idxmax()

'Mexican'

In [41]:
(final_df.groupby("user_id")["total_amount"].sum() > 1000).sum()

np.int64(2847)

In [42]:
import pandas as pd

bins = [3.0, 3.5, 4.0, 4.5, 5.0]
final_df["rating_range"] = pd.cut(final_df["rating"], bins)

In [43]:
final_df[final_df["membership"]=="Gold"] \
.groupby("city")["total_amount"].mean().idxmax()

'Chennai'

In [44]:
final_df.groupby("cuisine").agg(
    restaurants=("restaurant_id","nunique"),
    revenue=("total_amount","sum")
)

         restaurants     revenue
cuisine
Chinese          120  7722018.60
Indian           126  7885650.32
Italian          126  8096815.20
Mexican          128  8342012.36

In [45]:
round(
    (final_df[final_df["membership"]=="Gold"].shape[0] 
     / final_df.shape[0]) * 100
)

50

In [46]:
final_df.groupby("restaurant_name_y").agg(
    avg_order=("total_amount", "mean"),
    orders=("order_id", "count")
).query("orders < 20") \
 .sort_values("avg_order", ascending=False) \
 .head(1)

Empty DataFrame
Columns: [avg_order, orders]
Index: []

In [47]:
final_df.groupby(
    ["membership", "cuisine"]
)["total_amount"].sum().sort_values(ascending=False)

membership  cuisine
Regular     Mexican    4291773.20
            Italian    4073699.00
Gold        Mexican    4050239.16
            Italian    4023116.20
Regular     Indian     3968401.08
Gold        Indian     3917249.24
            Chinese    3910854.96
Regular     Chinese    3811163.64
Name: total_amount, dtype: float64

In [48]:
final_df["order_date"] = pd.to_datetime(final_df["order_date"], dayfirst=True)
final_df["quarter"] = final_df["order_date"].dt.to_period("Q")

final_df.groupby("quarter")["total_amount"].sum()

quarter
2023Q1    7973700.56
2023Q2    7781394.88
2023Q3    8149540.40
2023Q4    8073054.64
2024Q1      68806.00
Freq: Q-DEC, Name: total_amount, dtype: float64

In [49]:
final_df[final_df["membership"] == "Gold"].shape[0]

19948

In [50]:
round(
    final_df[final_df["city"] == "Hyderabad"]["total_amount"].sum()
)

7557466

In [51]:
final_df["user_id"].nunique()

2883

In [52]:
round(
    final_df[final_df["membership"] == "Gold"]["total_amount"].mean(),
    2
)

np.float64(797.15)

In [53]:
final_df[final_df["rating"] >= 4.5].shape[0]

13496

In [54]:
top_gold_city = (
    final_df[final_df["membership"] == "Gold"]
    .groupby("city")["total_amount"].sum()
    .idxmax()
)

top_gold_city

'Chennai'

In [55]:
final_df[
    (final_df["membership"] == "Gold") &
    (final_df["city"] == top_gold_city)
].shape[0]

5348